.config/doom/config.org
# -*- mode: org -*-
#+TITLE: Doom Emacs Configuration
#+AUTHOR: valentinlechner
#+PROPERTY: header-args:emacs-lisp :tangle yes :cache yes :results silent :comments link
#+PROPERTY: header-args :tangle no :results silent
#+HTML_HEAD: <link rel='shortcut icon' type='image/png' href='https://www.gnu.org/software/emacs/favicon.png'>

* Rudimentary configuration

Make this file run (slightly) faster with lexical binding (see [[https://nullprogram.com/blog/2016/12/22/][this blog post]]
for more info).
#+BEGIN_SRC emacs-lisp :comments no
;;; config.el -*- lexical-binding: t; -*-
#+END_SRC

** Personal information

#+BEGIN_SRC emacs-lisp
(setq user-full-name "Valentin Lechner"
      user-mail-address "valentin_lechner@dismail.de")
#+END_SRC

Speaking of ~GPG~, I want to use =~/.config/authinfo.gpg= instead of the default in
=~/.emacs.d=.
#+BEGIN_SRC emacs-lisp
(setq auth-sources '("~/.config/auth/authinfo.gpg")
      auth-source-cache-expiry nil) ; default is 7200 (2h)
#+END_SRC

In Germany, our week starts on monday
#+BEGIN_SRC emacs-lisp
(setq calendar-week-start-day 1)
#+END_SRC

** Doom configuration

*** Fontset

Doom exposes five (optional) variables for controlling fonts in Doom.
Here are the three important ones:

+ =doom-font=
+ =doom-variable-pitch-font=
+ =doom-big-font= -- used for =doom-big-font-mode=; use this for
  presentations or streaming.

They all accept either a font-spec, font string ("Input Mono-12"), or
xlfd font string.

For ligature-Support I use the Iosevka Font.
The main (=doom-font=) is a patched [[https://github.com/jsravn/iosevka-emacs][Iosevka Font]] (monospace,
extralight).

Ligature Showcase:
#+BEGIN_example
  <->
  <-->
  <--->
  <---->
  <----->
  ;; Double-ended equals arrows
  <=>
  <==>
  <===>
  <====>
  <=====>
  ;; Double-ended asterisk operators
  <**>
  <***>
  <****>
  <*****>
  ;; HTML comments
  <!--
  <!---
  ;; Three-char ops with discards
  <$
  <$>
  $>
  <.
  <.>
  .>
  <*
  <*>
  *>
  <\\
  <\\>
  \\>
  </
  </>
  />
  <\"
  <\">
  \">
  <'
  <'>
  '>
  <^
  <^>
  ^>
  <&
  <&>
  &>
  <%
  <%>
  %>
  <@
  <@>
  @>
  <#
  <#>
  #>
  <+
  <+>
  +>
  <-
  <->
  ->
  <!
  <!>
  !>
  <?
  <?>
  ?>
  <|
  <|>
  |>
  <:
  <:>
  :>
  ;; Colons
  ::
  :::
  ::::
  ;; Arrow-like operators
  ->
  ->-
  ->--
  ->>
  ->>-
  ->>--
  ->>>
  ->>>-
  ->>>--
  -->
  -->-
  -->--
  -->>
  -->>-
  -->>--
  -->>>
  -->>>-
  -->>>--
  >-
  >--
  >>-
  >>--
  >>>-
  >>>--
  =>
  =>=
  =>==
  =>>
  =>>=
  =>>==
  =>>>
  =>>>=
  =>>>==
  ==>
  ==>=
  ==>==
  ==>>
  ==>>=
  ==>>==
  ==>>>
  ==>>>=
  ==>>>==
  >=
  >==
  >>=
  >>==
  >>>=
  >>>==
  <-
  -<-
  --<-
  <<-
  -<<-
  --<<-
  <<<-
  -<<<-
  --<<<-
  <--
  -<--
  --<--
  <<--
  -<<--
  --<<--
  <<<--
  -<<<--
  --<<<--
  -<
  --<
  -<<
  --<<
  -<<<
  --<<<
  <=
  =<=
  ==<=
  <<=
  =<<=
  ==<<=
  <<<=
  =<<<=
  ==<<<=
  <==
  =<==
  ==<==
  <<==
  =<<==
  ==<<==
  <<<==
  =<<<==
  ==<<<==
  =<
  ==<
  =<<
  ==<<
  =<<<
  ==<<<
  ;; Monadic operators
  >=>
  >->
  >-->
  >==>
  <=<
  <-<
  <--<
  <==<
  ;; Composition operators
  >>
  >>>
  <<
  <<<
  ;; Lens operators
  :+
  :-
  :=
  +:
  -:
  =:
  =^
  =+
  =-
  =*
  =/
  =%
  ^=
  +=
  -=
  *=
  /=
  %=
  ;; Logical
  /\\
  \\/
  <>
  <+
  <+>
  +>
#+END_example

The =variable-pitch-font=, which gets used in =variable-pitch-mode= or
=mixed-pitch-mode=, is the Quasi-Proportional Font /Iosevka Sparkle/, in
my case taken directly from the
[[https://github.com/be5invis/Iosevka/releases/tag/v3.4.6][Iosevka Repository]]

The =doom-serif-font= is from the same repository.
#+BEGIN_SRC emacs-lisp
(setq doom-font (font-spec
                    :family "Iosevka"
                    :size 22
                    :weight 'extralight)
      doom-variable-pitch-font (font-spec
                                :family "Iosevka Sparkle"
                                :weight 'extralight
                                :size 22)
      doom-big-font (font-spec
                     :family "Iosevka"
                     :weight 'light
                     :size 24)
      doom-serif-font (font-spec
                       :family "Iosevka Aile"
                       :weight 'extralight
                       :size 22))
#+END_SRC

*** Theme

There are two ways to load a theme. Both assume the theme is installed
and available. You can either set `doom-theme' or manually load a
theme with the `load-theme' function. This is the default:
#+BEGIN_SRC emacs-lisp
(setq doom-theme 'doom-moonlight)
#+END_SRC

Changes the name of the dashboard to something recognisable
#+BEGIN_SRC emacs-lisp
(setq doom-fallback-buffer-name "► Doom"
      +doom-dashboard-name "► Doom")
#+END_SRC

** Editor settings


*** Line numbering

This determines the style of line numbers in effect. If set to `nil', line
numbers are disabled. For relative line numbers, set this to `relative'.
#+BEGIN_SRC emacs-lisp
(setq display-line-numbers-type 'relative)
#+END_SRC

*** Nyan Mode

Use NyanCat to show buffer size and position in mode-line
#+BEGIN_SRC emacs-lisp
(nyan-mode 0)
(use-package! nyan-mode
  :config
  (setq nyan-animate-nyancat t)
  (setq nyan-wavy-trail t))
#+END_SRC

*** Poke-Line

Testing out poke-line instead of nyan-mode
#+BEGIN_SRC emacs-lisp
(use-package! poke-line
  :config
  (poke-line-global-mode 1)
  (poke-line-set-pokemon "magikarp"))
#+END_SRC

*** Default encoding
I like my files to always use =utf-8= encoding
#+BEGIN_SRC emacs-lisp
(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
#+END_SRC

*** Tabs vs whitespaces?!

As for the whitespace/tabs debate, I use whitespaces.
I like to specify that tabs are just x spaces, depending on language.
My argument against tabs is that it is something you can't see in a
lot of editors or a lot of viewers, for example in a webpage, by
default. Usually, I would assume that there are spaces - but who
knows?
#+BEGIN_SRC emacs-lisp
(setq  indent-tabs-mode nil)
#+END_SRC
Therefore, I use a global editorconfig file:
#+BEGIN_SRC conf :tangle ~/.editorconfig
[*]
end_of_line = lf
indent_style = space
#+END_SRC

*** Window Layout

Take new window space from all windows, not just the active one
#+BEGIN_SRC emacs-lisp
(setq window-combination-resize t)
#+END_SRC

*** Better Undo

Making changes more granular for undo
#+BEGIN_SRC emacs-lisp
(setq evil-want-fine-undo t)
#+END_SRC
*** Autosaving

#+BEGIN_SRC emacs-lisp
(setq auto-save-default t)
#+END_SRC

*** Better ellipsis

Use unicode ellipsis instead of ... - it saves a lot of space
#+BEGIN_SRC emacs-lisp
(setq truncate-string-ellipsis "…")
#+END_SRC

*** Final newline in files?!

Since the final newline did mess with my ~~/.authinfo.gpg~ for forge quite a lot
(it doesn't allow a final newline) I decided why not deactivate it.
#+BEGIN_SRC emacs-lisp
(setq require-final-newline nil)
#+END_SRC

*** Mouse-pasting
set mouse to yank where i click: http://sachachua.com/blog/2017/04/emacs-pasting-with-the-mouse-without-moving-the-point-mouse-yank-at-point/
#+BEGIN_SRC emacs-lisp
(setq mouse-yank-at-point t)
#+END_SRC



** Programming settings

*** Autocompletion
Ensure, that autocompletion only helps when needed.
The author of doom, hlissner, says to this on his personal config:
#+BEGIN_QUOTE
IMO, modern editors have trained a bad habit into us all: a burning
need for completion all the time -- as we type, as we breathe, as we
pray to the ancient ones -- but how often do you *really* need that
information? I say rarely. So opt for manual completion:
can be invoked using C-SPC
   --- hlissner
#+END_QUOTE
After working on a few large projects where you would SMASH the ESC-key to
cancel loading suggestions, I appreciate that opinion.
#+BEGIN_SRC emacs-lisp
(setq company-idle-delay nil)
#+END_SRC

*** Whitespace Mode

I like displaying whitespaces, returns and so on
A positive value activates it, negative turns it off. However, I have
found that it's usually not needed when just writing.
Therefore, it's not a global mode, only activated in programming mode.
#+BEGIN_SRC emacs-lisp
(add-hook 'prog-mode-hook #'whitespace-mode)
#+END_SRC

*** Rainbows

Rainbow mode is for previewing #RRGGBB, {rgb}, {HTML}
It doesnt have a global mode
According to
https://stackoverflow.com/questions/16048231/how-to-enable-a-non-global-minor-mode-by-default-on-emacs-startup
you can enable it globally like this
#+BEGIN_SRC emacs-lisp
(define-globalized-minor-mode my-global-rainbow-mode rainbow-mode
  (lambda () (rainbow-mode 1)))

(my-global-rainbow-mode 1)
#+END_SRC
The other mode i like a lot is the rainbow delimiters mode
It displays parentheses in colors, depending on their 'deepness'
It's mainly useful in programming
#+BEGIN_SRC emacs-lisp
(add-hook 'prog-mode-hook 'rainbow-delimiters-mode)
#+END_SRC

*** Visual Line

I like the visual line mode
#+BEGIN_SRC emacs-lisp
(global-visual-line-mode +1)
#+END_SRC

** Modeline settings

Show battery and time in modeline
#+BEGIN_SRC emacs-lisp
(display-time-mode +1)
(display-battery-mode +1)
#+END_SRC
We expect the encoding to be LF UTF-8, so only show the modeline when this is not the case
#+BEGIN_SRC emacs-lisp
(defun doom-modeline-conditional-buffer-encoding ()
  "We expect the encoding to be LF UTF-8, so only show the modeline when this is not the case"
  (setq-local doom-modeline-buffer-encoding
              (unless (or (eq buffer-file-coding-system 'utf-8-unix)
                          (eq buffer-file-coding-system 'utf-8)))))

(add-hook 'after-change-major-mode-hook #'doom-modeline-conditional-buffer-encoding)
#+END_SRC


