.config/doom/config.el
;;; config.el -*- lexical-binding: t; -*-

;; [[file:config.org::*Personal information][Personal information:1]]
(setq user-full-name "Valentin Lechner"
      user-mail-address "valentin_lechner@dismail.de")
;; Personal information:1 ends here

;; [[file:config.org::*Personal information][Personal information:2]]
(setq auth-sources '("~/.config/auth/authinfo.gpg")
      auth-source-cache-expiry nil) ; default is 7200 (2h)
;; Personal information:2 ends here

;; [[file:config.org::*Personal information][Personal information:3]]
(setq calendar-week-start-day 1)
;; Personal information:3 ends here

;; [[file:config.org::*Fontset][Fontset:1]]
(setq doom-font (font-spec
                    :family "Iosevka"
                    :size 22
                    :weight 'extralight)
      doom-variable-pitch-font (font-spec
                                :family "Iosevka Sparkle"
                                :weight 'extralight
                                :size 22)
      doom-big-font (font-spec
                     :family "Iosevka"
                     :weight 'light
                     :size 24)
      doom-serif-font (font-spec
                       :family "Iosevka Aile"
                       :weight 'extralight
                       :size 22))
;; Fontset:1 ends here

;; [[file:config.org::*Theme][Theme:1]]
(setq doom-theme 'doom-moonlight)
;; Theme:1 ends here

;; [[file:config.org::*Theme][Theme:2]]
(setq doom-fallback-buffer-name "► Doom"
      +doom-dashboard-name "► Doom")
;; Theme:2 ends here

;; [[file:config.org::*Line numbering][Line numbering:1]]
(setq display-line-numbers-type 'relative)
;; Line numbering:1 ends here

;; [[file:config.org::*Nyan Mode][Nyan Mode:1]]
(nyan-mode 0)
(use-package! nyan-mode
  :config
  (setq nyan-animate-nyancat t)
  (setq nyan-wavy-trail t))
;; Nyan Mode:1 ends here

;; [[file:config.org::*Poke-Line][Poke-Line:1]]
(use-package! poke-line
  :config
  (poke-line-global-mode 1)
  (poke-line-set-pokemon "magikarp"))
;; Poke-Line:1 ends here

;; [[file:config.org::*Default encoding][Default encoding:1]]
(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
;; Default encoding:1 ends here

;; [[file:config.org::*Tabs vs whitespaces?!][Tabs vs whitespaces?!:1]]
(setq  indent-tabs-mode nil)
;; Tabs vs whitespaces?!:1 ends here

;; [[file:config.org::*Window Layout][Window Layout:1]]
(setq window-combination-resize t)
;; Window Layout:1 ends here

;; [[file:config.org::*Better Undo][Better Undo:1]]
(setq evil-want-fine-undo t)
;; Better Undo:1 ends here

;; [[file:config.org::*Autosaving][Autosaving:1]]
(setq auto-save-default t)
;; Autosaving:1 ends here

;; [[file:config.org::*Better ellipsis][Better ellipsis:1]]
(setq truncate-string-ellipsis "…")
;; Better ellipsis:1 ends here

;; [[file:config.org::*Final newline in files?!][Final newline in files?!:1]]
(setq require-final-newline nil)
;; Final newline in files?!:1 ends here

;; [[file:config.org::*Mouse-pasting][Mouse-pasting:1]]
(setq mouse-yank-at-point t)
;; Mouse-pasting:1 ends here

;; [[file:config.org::*Autocompletion][Autocompletion:1]]
(setq company-idle-delay nil)
;; Autocompletion:1 ends here

;; [[file:config.org::*Whitespace Mode][Whitespace Mode:1]]
(add-hook 'prog-mode-hook #'whitespace-mode)
;; Whitespace Mode:1 ends here

;; [[file:config.org::*Rainbows][Rainbows:1]]
(define-globalized-minor-mode my-global-rainbow-mode rainbow-mode
  (lambda () (rainbow-mode 1)))

(my-global-rainbow-mode 1)
;; Rainbows:1 ends here

;; [[file:config.org::*Rainbows][Rainbows:2]]
(add-hook 'prog-mode-hook 'rainbow-delimiters-mode)
;; Rainbows:2 ends here

;; [[file:config.org::*Visual Line][Visual Line:1]]
(global-visual-line-mode +1)
;; Visual Line:1 ends here

;; [[file:config.org::*Modeline settings][Modeline settings:1]]
(display-time-mode +1)
(display-battery-mode +1)
;; Modeline settings:1 ends here

;; [[file:config.org::*Modeline settings][Modeline settings:2]]
(defun doom-modeline-conditional-buffer-encoding ()
  "We expect the encoding to be LF UTF-8, so only show the modeline when this is not the case"
  (setq-local doom-modeline-buffer-encoding
              (unless (or (eq buffer-file-coding-system 'utf-8-unix)
                          (eq buffer-file-coding-system 'utf-8)))))

(add-hook 'after-change-major-mode-hook #'doom-modeline-conditional-buffer-encoding)
;; Modeline settings:2 ends here

;; [[file:config.org::*Treemacs][Treemacs:1]]
(after! treemacs
