.config/doom/config.el
  (defvar treemacs-file-ignore-extensions '()
    "File extension which 'treemacs-ignore-filter' will ensure are ignored")
  (defvar treemacs-file-ignore-globs '()
    "Globs which will are transformed to 'treemacs-file-ignore-regexps' which 'treemacs-ignore-filter' will ensure are ignored")
  (defvar treemacs-file-ignore-regexps '()
    "RegExps to be tested to ignore files, generated from 'treeemacs-file-ignore-globs'")
  (defun treemacs-file-ignore-generate-regexps ()
    "Generate 'treemacs-file-ignore-regexps' from 'treemacs-file-ignore-globs'"
    (setq treemacs-file-ignore-regexps (mapcar 'dired-glob-regexp treemacs-file-ignore-globs)))
  (if (equal treemacs-file-ignore-globs '()) nil (treemacs-file-ignore-generate-regexps))
  (defun treemacs-ignore-filter (file full-path)
    "Ignore files specified by 'treemacs-file-ignore-extensions', and 'treemacs-file-ignore-regexps'"
    (or (member (file-name-extension file) treemacs-file-ignore-extensions)
        (let ((ignore-file nil))
          (dolist (regexp treemacs-file-ignore-regexps ignore-file)
            (setq ignore-file (or ignore-file (if (string-match-p regexp full-path) t nil)))))))
  (add-to-list 'treemacs-ignored-file-predicates #'treemacs-ignore-filter))
;; Treemacs:1 ends here

;; [[file:config.org::*Treemacs Blocklist][Treemacs Blocklist:1]]
(setq treemacs-file-ignore-extensions '(;; LaTeX
                                        "aux"
                                        "ptc"
                                        "fdb_latexmk"
                                        "bbl"
                                        "fls"
                                        "synctex.gz"
                                        "toc"
                                        ;; LaTeX - glossary
                                        "glg"
                                        "glo"
                                        "gls"
                                        "glsdefs"
                                        "ist"
                                        "acn"
                                        "acr"
                                        "alg"
                                        ;; LaTeX - pgfplots
                                        "mw"
                                        ;; LaTeX - pdfx
                                        "pdfa.xmpi"
                                        ;; Python Compiled
                                        "pyc"
                                        ;; Elisp compiled
                                        "elc"
                                        ))
(setq treemacs-file-ignore-globs '(;; LaTeX
                                   "*/_minted-*"
                                   ;; AucTeX
                                   "*/.auctex-auto"
                                   "*/_region_.log"
                                   "*/_region_.tex"))
;; Treemacs Blocklist:1 ends here

;; [[file:config.org::*Org][Org:1]]
(setq org-directory "~/Daten/cloud/tlaloc/org/"
      org-archive-location (concat org-directory ".archive/$s::"))
;; Org:1 ends here

;; [[file:config.org::*Org][Org:2]]
(use-package! org
;; Org:2 ends here

;; [[file:config.org::*Configuring org][Configuring org:1]]
  :config
;; Configuring org:1 ends here

;; [[file:config.org::*Org Style][Org Style:1]]
(setq
  org-ellipsis " ▼ "
  org-superstar-headline-bullets-list '("✿" "■" "◆" "▲" "#")
)
;; Org Style:1 ends here

;; [[file:config.org::*Org Style][Org Style:2]]
  (setq global-org-pretty-table-mode t)
;; Org Style:2 ends here

;; [[file:config.org::*Org Style][Org Style:3]]
  (setq org-use-property-inheritance t)
;; Org Style:3 ends here

;; [[file:config.org::*Org Style][Org Style:4]]
(custom-set-faces!
  '(outline-1 :weight extra-bold :height 1.25)
  '(outline-2 :weight bold :height 1.15)
  '(outline-3 :weight bold :height 1.12)
  '(outline-4 :weight semi-bold :height 1.09)
  '(outline-5 :weight semi-bold :height 1.06)
  '(outline-6 :weight semi-bold :height 1.03)
  '(outline-8 :weight semi-bold)
  '(outline-9 :weight semi-bold))
;; Org Style:4 ends here

;; [[file:config.org::*Org Style][Org Style:5]]
(custom-set-faces!
    '(org-document-title :height 1.2))
;; Org Style:5 ends here

;; [[file:config.org::*Org Style][Org Style:6]]
(setq org-hide-leading-stars t)
;; Org Style:6 ends here

;; [[file:config.org::*Org Style][Org Style:7]]
(setq org-src-fontify-natively t)
;; Org Style:7 ends here

;; [[file:config.org::*Org Style][Org Style:8]]
(add-hook! 'org-mode-hook #'+org-pretty-mode
           'org-fragtog-mode
           'mixed-pitch-mode)
(setq global-org-pretty-table-mode t)
(setq
 org-fontify-whole-heading-line t
 org-fontify-done-headline t
 org-fontify-quote-and-verse-blocks t)
;; Org Style:8 ends here

;; [[file:config.org::*Org Style][Org Style:9]]
(setq org-agenda-breadcrumbs-seperator " ❱ ")
;; Org Style:9 ends here

;; [[file:config.org::*Org Style][Org Style:10]]
(setq org-hide-emphasis-markers t)
;; Org Style:10 ends here

;; [[file:config.org::*Org Style][Org Style:11]]
(appendq! +ligatures-extra-symbols
            `(:checkbox      "☐"
              :pending       "◼"
              :checkedbox    "☑"
              :list_property "∷"
              :results       "R"
              :property      "P"
              :properties    "P"
              :end           "∎"
              :options       "O"
              :title         "T"
              :subtitle      "ST"
              :author        "A"
              :date          "D"
              :latex_header  "LH"
              :latex_class   "LC"
              :beamer_header "BH"
              :html_head     "HH"
              :begin_quote   "❮"
              :end_quote     "❯"
              :begin_export  "⬇"
              :end_export    "⬆"
              :priority_a   ,(propertize "⚑" 'face 'all-the-icons-red)
              :priority_b   ,(propertize "⬆" 'face 'all-the-icons-orange)
              :priority_c   ,(propertize "■" 'face 'all-the-icons-yellow)
              :priority_d   ,(propertize "⬇" 'face 'all-the-icons-green)
              :priority_e   ,(propertize "❓" 'face 'all-the-icons-blue)
              :em_dash       "—"))
  (set-ligatures! 'org-mode
    :merge t
    :checkbox      "[ ]"
    :pending       "[-]"
    :checkedbox    "[X]"
    :list_property "::"
    :results       "#+RESULTS:"
    :property      "#+PROPERTY:"
    :property      ":PROPERTIES:"
    :end           ":END:"
    :options       "#+OPTIONS:"
    :title         "#+TITLE:"
    :subtitle      "#+SUBTITLE:"
    :author        "#+AUTHOR:"
    :date          "#+DATE:"
    :latex_class   "#+LATEX_CLASS:"
    :latex_header  "#+LATEX_HEADER:"
    :html_head     "#+HTML_HEAD:"
    :beamer_header "#+BEAMER_HEADER:"
    :begin_quote   "#+BEGIN_QUOTE"
    :end_quote     "#+END_QUOTE"
    :begin_export  "#+BEGIN_EXPORT"
    :end_export    "#+END_EXPORT"
    :priority_a    "[#A]"
    :priority_b    "[#B]"
    :priority_c    "[#C]"
    :priority_d    "[#D]"
    :priority_e    "[#E]"
    :em_dash       "---")
    (plist-put +ligatures-extra-symbols
               :name "›")
;; Org Style:11 ends here

;; [[file:config.org::*Indentation][Indentation:1]]
  (setq org-startup-indented nil)
  (setq org-indent-indentation-per-level 1)
;; Indentation:1 ends here

;; [[file:config.org::*Indentation][Indentation:2]]
  (setq org-adapt-indentation nil)
;; Indentation:2 ends here
